benchmarks/runpod_h100sxm/benchmark_results_gpt_oss_120b_h100sxm_runpod/run_1_TP4_DP2_CTX8192_C100_P100_O128.txt
BENCHMARK: run_1_TP4_DP2_CTX8192_C100_P100_O128
================================================================
The tokenizer you are loading from '/workspace/gpt-oss' with an incorrect regex pattern: https://huggingface.co/mistralai/Mistral-Small-3.1-24B-Instruct-2503/discussions/84#69121093e8b480e709447d5e. This will lead to incorrect tokenization. You should set the `fix_mistral_regex=True` flag when loading this tokenizer to fix this issue.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71f8c561e840>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=8192, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='/workspace/gpt-oss', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_gpt_oss_120b_h100sxm_runpod', result_filename='run_1_TP4_DP2_CTX8192_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-cfebb75d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-29 03:52:24 [datasets.py:612] Sampling input_len from [8192, 8192] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:07<13:10,  7.98s/it]
 15%|█▌        | 15/100 [00:08<00:32,  2.58it/s]
 35%|███▌      | 35/100 [00:08<00:08,  7.39it/s]
 59%|█████▉    | 59/100 [00:08<00:02, 15.22it/s]
 84%|████████▍ | 84/100 [00:08<00:00, 25.92it/s]
100%|██████████| 100/100 [00:08<00:00, 11.83it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  8.46      
Total input tokens:                      819200    
Total generated tokens:                  12800     
Request throughput (req/s):              11.83     
Output token throughput (tok/s):         1513.83   
Peak output token throughput (tok/s):    5899.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          98399.09  
---------------Time to First Token----------------
Mean TTFT (ms):                          3467.67   
Median TTFT (ms):                        3520.98   
P99 TTFT (ms):                           6339.71   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.55     
Median TPOT (ms):                        37.17     
P99 TPOT (ms):                           59.05     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.55     
Median ITL (ms):                         16.94     
P99 ITL (ms):                            182.04    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8236.16   
Median E2EL (ms):                        8242.20   
P99 E2EL (ms):                           8410.94   
==================================================