benchmarks/runpod_h100sxm/benchmark_results_gpt_oss_120b_h100sxm_runpod/run_1_TP8_DP1_CTX15000_C100_P100_O128.txt
BENCHMARK: run_1_TP8_DP1_CTX15000_C100_P100_O128
================================================================
The tokenizer you are loading from '/workspace/gpt-oss' with an incorrect regex pattern: https://huggingface.co/mistralai/Mistral-Small-3.1-24B-Instruct-2503/discussions/84#69121093e8b480e709447d5e. This will lead to incorrect tokenization. You should set the `fix_mistral_regex=True` flag when loading this tokenizer to fix this issue.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x74071c94e840>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15000, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='/workspace/gpt-oss', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_gpt_oss_120b_h100sxm_runpod', result_filename='run_1_TP8_DP1_CTX15000_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-bda224a5-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-29 03:48:20 [datasets.py:612] Sampling input_len from [15000, 15000] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:09<16:15,  9.86s/it]
  5%|▌         | 5/100 [00:09<02:21,  1.49s/it]
 13%|█▎        | 13/100 [00:10<00:38,  2.25it/s]
 21%|██        | 21/100 [00:10<00:17,  4.40it/s]
 29%|██▉       | 29/100 [00:10<00:09,  7.25it/s]
 37%|███▋      | 37/100 [00:10<00:05, 10.94it/s]
 45%|████▌     | 45/100 [00:10<00:03, 15.63it/s]
 54%|█████▍    | 54/100 [00:10<00:02, 22.14it/s]
 65%|██████▌   | 65/100 [00:10<00:01, 31.65it/s]
 75%|███████▌  | 75/100 [00:10<00:00, 40.66it/s]
 90%|█████████ | 90/100 [00:10<00:00, 58.03it/s]
100%|██████████| 100/100 [00:10<00:00,  9.12it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  10.97     
Total input tokens:                      1500000   
Total generated tokens:                  12800     
Request throughput (req/s):              9.12      
Output token throughput (tok/s):         1167.15   
Peak output token throughput (tok/s):    5160.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          137942.90 
---------------Time to First Token----------------
Mean TTFT (ms):                          4748.55   
Median TTFT (ms):                        4736.90   
P99 TTFT (ms):                           9036.51   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.06     
Median TPOT (ms):                        45.31     
P99 TPOT (ms):                           73.54     
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.08     
Median ITL (ms):                         17.17     
P99 ITL (ms):                            109.57    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          10471.73  
Median E2EL (ms):                        10490.70  
P99 E2EL (ms):                           10888.46  
==================================================